0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.1);

boundaryField
{
    parede
    {
	type symmetry;
        // type            wall;
        // value           uniform (0 0 0);
    }

    extremos
    {
        type            wall;
	value		uniform (0 0 0);
    }

    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    coolant_to_cladding
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    fc
    {
	type zeroGradient;
    }
    cc
    {
	type zeroGradient;
    }
}


// ************************************************************************* //
