system/coolant/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG
        preconditioner  DIC;
        tolerance       1e-05;
        relTol          0.01;
    }

    p_rgh
    {
        solver           GAMG;
        tolerance        1e-05;
        relTol           0.01;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;    
        cacheAgglomeration true;
        nCellsInCoarsestLevel 1000;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance        1e-06;
        relTol           0.01;
    } 

    "(U|k|epsilon)"
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0.01;
    }

    // h tem caracteristicas especiais: garantir que a equação
    // será sempre resolvida, mesmo se já convergiu
    h
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0.01;

	// Força ao menos uma iteração
	minIter          1;
    }
}

SIMPLE
{
  // Consistent yes significa método SIMPLEC
  //  consistent      yes;
  momentumPredictor on;
  nNonOrthogonalCorrectors 1; //0; 
  pRefCell        0;
  pRefValue       1750000;
  rhoMin          rhoMin [1 -3 0 0 0] 900; //300; 
  rhoMax          rhoMax [1 -3 0 0 0] 1100; ////1e9; //1200;
  
  residualControl
    {
      p_rgh         1e-4;
      U             1e-4;
      h             1e-4;
    }
}

relaxationFactors
{
    fields
    {
//        rho             1;
        p_rgh           0.7; 
    }
    equations
    {
        U               0.7;
        h               0.7;
        nuTilda         0.7;
        k               0.7;
        epsilon         0.7;
        omega           0.7;
        "ILambda.*"     0.7;
    }
}

// ************************************************************************* //
